#+TITLE:  My Emacs Configuration
#+AUTHOR: JJ Asghar
#+EMAIL:  jjasghar@gmail.com

** mode-line changes

It looks like: =(x)(y) **[File] U: Mode 12% 10k=

#+BEGIN_SRC emacs-lisp
  (setq-default mode-line-format
                (list
                 ;; value of current line number
                 ;; value of current column number
                 " (%l,%c)  "

                 ;; been modified
                 "%+"
                 ;; readonly
                 "%*"
                 ;; value of current buffer name
                 "[%b] "
                 ;; coding
                 "%Z"
                 ;; value of `mode-name'
                 " %m "
                 ;; location
                 " %p "
                 ;; size of the file
                 " %I "
                 ;; value of test-size
                 " %n "
                 ))

#+END_SRC

#+RESULTS:
| (%l,%c) | %+ | %* | [%b] | %Z | %m | %p | %I | %n |

